# **Chapter 7: Data Cleaning and Preparation**

## **7.1 Handling Missing Data**

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### **Filtering Out Missing Data**

In [8]:
from numpy import nan as NA # NA = np.nan

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df.iloc[:4, 1] = NA

In [22]:
df.iloc[:2, 2] = NA

In [23]:
df

          0         1         2
0 -0.154883       NaN       NaN
1  2.337603       NaN       NaN
2 -0.528929       NaN -1.467529
3  0.018230       NaN -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [24]:
df.dropna()

          0         1         2
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [25]:
df.dropna(thresh=2) #en az 2 dolu değer içeren satırlar harici kalanları düşür.

          0         1         2
2 -0.528929       NaN -1.467529
3  0.018230       NaN -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

## **Filling In Missing Data**

In [26]:
df

          0         1         2
0 -0.154883       NaN       NaN
1  2.337603       NaN       NaN
2 -0.528929       NaN -1.467529
3  0.018230       NaN -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [27]:
df.fillna(0)

          0         1         2
0 -0.154883  0.000000  0.000000
1  2.337603  0.000000  0.000000
2 -0.528929  0.000000 -1.467529
3  0.018230  0.000000 -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.154883  0.500000  0.000000
1  2.337603  0.500000  0.000000
2 -0.528929  0.500000 -1.467529
3  0.018230  0.500000 -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [29]:
_ = df.fillna(0, inplace=True)

In [30]:
df

          0         1         2
0 -0.154883  0.000000  0.000000
1  2.337603  0.000000  0.000000
2 -0.528929  0.000000 -1.467529
3  0.018230  0.000000 -0.198765
4 -1.056067 -1.250719 -0.521756
5  0.977983 -1.301024  0.131273
6  1.925837  0.067048 -0.355469

In [31]:
df = pd.DataFrame(np.random.randn(6, 3))

In [32]:
df.iloc[2:, 1] = NA

In [33]:
df.iloc[4:, 2] = NA

In [34]:
df

          0         1         2
0 -0.539532  0.358966 -0.558787
1  0.359591 -0.669223 -1.741554
2  1.001178       NaN -0.132723
3  0.178113       NaN -0.256670
4  0.017135       NaN       NaN
5  0.614727       NaN       NaN

In [35]:
df.fillna(method="ffill")

          0         1         2
0 -0.539532  0.358966 -0.558787
1  0.359591 -0.669223 -1.741554
2  1.001178 -0.669223 -0.132723
3  0.178113 -0.669223 -0.256670
4  0.017135 -0.669223 -0.256670
5  0.614727 -0.669223 -0.256670

In [36]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [37]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## **7.2 Data Transformation**

### **Removing Duplicates**

In [39]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [40]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [41]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [42]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
data['v1'] = range(7)

In [44]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [45]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [47]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### **Transforming Data Using a Function or Mapping**

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                                          'Pastrami', 'corned beef', 'Bacon',
                                          'pastrami', 'honey ham', 'nova lox'],
                                             'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [51]:
lowercased = data["food"].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [52]:
data["animal"] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### **Replacing Values**

In [54]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [55]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                   index = ['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [61]:
transform = lambda x: x[:4].upper()

In [62]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform)

In [64]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [65]:
data.rename(index = str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [66]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [67]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [68]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### **Discretization and Binning**

In [69]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [70]:
bins = [18, 25, 35, 60, 100]

In [71]:
cats = pd.cut(ages, bins)

In [72]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [73]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [74]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [75]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [76]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [77]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [78]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [79]:
data = np.random.randn(20)

In [80]:
pd.cut(data, 4, precision=2)

[(-0.62, 0.1], (-1.34, -0.62], (0.82, 1.55], (-0.62, 0.1], (0.82, 1.55], ..., (-0.62, 0.1], (-0.62, 0.1], (-0.62, 0.1], (0.82, 1.55], (-0.62, 0.1]]
Length: 20
Categories (4, interval[float64]): [(-1.34, -0.62] < (-0.62, 0.1] < (0.1, 0.82] < (0.82, 1.55]]

In [81]:
 data = np.random.randn(1000) # Normally distributed

In [82]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [83]:
cats

[(-0.676, 0.0238], (-0.676, 0.0238], (0.638, 3.418], (-0.676, 0.0238], (-0.676, 0.0238], ..., (0.638, 3.418], (-0.676, 0.0238], (-0.676, 0.0238], (0.0238, 0.638], (-3.074, -0.676]]
Length: 1000
Categories (4, interval[float64]): [(-3.074, -0.676] < (-0.676, 0.0238] < (0.0238, 0.638] < (0.638, 3.418]]

In [84]:
pd.value_counts(cats)

(0.638, 3.418]      250
(0.0238, 0.638]     250
(-0.676, 0.0238]    250
(-3.074, -0.676]    250
dtype: int64

In [85]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.308, 0.0238], (-1.308, 0.0238], (0.0238, 1.317], (-1.308, 0.0238], (-1.308, 0.0238], ..., (0.0238, 1.317], (-1.308, 0.0238], (-1.308, 0.0238], (0.0238, 1.317], (-3.074, -1.308]]
Length: 1000
Categories (4, interval[float64]): [(-3.074, -1.308] < (-1.308, 0.0238] < (0.0238, 1.317] < (1.317, 3.418]]

### **Detecting and Filtering Outliers**

In [86]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [87]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015368     0.017545    -0.029037     0.009124
std       0.988783     0.965441     0.965992     1.000311
min      -2.823937    -3.226746    -3.180043    -3.713215
25%      -0.705690    -0.645806    -0.684161    -0.658061
50%       0.005766     0.026269    -0.030364    -0.002042
75%       0.648605     0.633499     0.639896     0.671746
max       3.081809     2.789628     2.577299     3.500821

In [88]:
col = data[2]

In [89]:
col

0      0.502641
1      0.462892
2     -0.021713
3     -1.769078
4      0.868359
         ...
995   -0.060487
996   -0.820955
997    0.165806
998   -1.594472
999    0.150989
Name: 2, Length: 1000, dtype: float64

In [90]:
col[np.abs(col)>3]

281   -3.135631
840   -3.180043
Name: 2, dtype: float64

In [91]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
281  1.819839 -0.466842 -3.135631  0.286081
440 -1.660022  1.287728  0.356475 -3.713215
507  0.462859 -3.226746 -0.728071 -1.036746
572  3.081809  0.210998 -1.196151 -0.917139
840  2.233662  0.945147 -3.180043  0.508352
842 -0.999668 -0.827522  0.334556  3.016948
870  0.087637 -0.293582 -1.492435  3.500821
906 -0.034348 -3.004838  0.737394 -0.073378

In [92]:
data[np.abs(data) > 3] = np.sign(data)*3

In [93]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.015449     0.017777    -0.028721     0.009319
std       0.988529     0.964690     0.964994     0.996226
min      -2.823937    -3.000000    -3.000000    -3.000000
25%      -0.705690    -0.645806    -0.684161    -0.658061
50%       0.005766     0.026269    -0.030364    -0.002042
75%       0.648605     0.633499     0.639896     0.671746
max       3.000000     2.789628     2.577299     3.000000

In [94]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0  1.0  1.0  1.0

### **Permutation and Random Sampling**

In [95]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [96]:
sampler = np.random.permutation(5)

In [97]:
sampler

array([0, 1, 4, 2, 3])

In [98]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [99]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [100]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [101]:
choices = pd.Series([5, 7, -1, 6, 4])

In [102]:
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
1    7
1    7
2   -1
1    7
4    4
2   -1
0    5
2   -1
dtype: int64

### **Computing Indicator/Dummy Variables**

In [103]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [104]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [105]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [106]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [107]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [108]:
df_with_dummy = df[["data1"]].join(dummies)

In [109]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
mnames = ['movie_id', 'title', 'genres']

In [111]:
movies  = pd.read_table("../datasets/movielens/movies.dat", sep="::", header=None, names=mnames)

/home/recepaydogdu/.local/lib/python3.8/site-packages/pandas/io/parsers.py:767: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

In [112]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [113]:
all_genres = []

In [114]:
for x in movies.genres:
    all_genres.extend(x.split("|"))

In [115]:
genres = pd.unique(all_genres)

In [116]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [117]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [118]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [119]:
gen = movies.genres[0]

In [120]:
gen.split("|")

['Animation', "Children's", 'Comedy']

In [121]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2])

In [122]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split("|"))
    dummies.iloc[i, indices] = 1

In [123]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [124]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [125]:
np.random.seed(12345)

In [126]:
values = np.random.rand(10)

In [127]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [128]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [129]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## **7.3 String Manipulation**

### **String Object Methods**

In [130]:
val = 'a,b, guido'

In [131]:
val.split(",")

['a', 'b', ' guido']

In [132]:
pieces = [x.strip() for x in val.split(',')]

In [133]:
pieces

['a', 'b', 'guido']

In [134]:
first, second, third = pieces

In [135]:
first + "::" + second + "::" + third

'a::b::guido'

In [136]:
"::".join(pieces)

'a::b::guido'

In [137]:
"guido" in val

True

In [138]:
val.index(",")

1

In [139]:
val.find(":")

-1

In [140]:
val.index(":")

ValueError: substring not found

In [141]:
val.count(",")

2

In [142]:
val.replace(',', '::')

'a::b:: guido'

In [143]:
val.replace(",", "")

'ab guido'

### **Regular Expressions**

In [146]:
import re

In [153]:
text = "foo bar\t baz \tqux"
text

'foo bar\t baz \tqux'

In [157]:
re.split("\s+", text)

['foo', 'bar', 'baz', 'qux']

In [155]:
regex = re.compile("\s+")

In [156]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [158]:
regex.findall(text)

[' ', '\t ', ' \t']

In [159]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [160]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [161]:
#re.IGNORECASE, normal ifadeyi büyük / küçük harfe duyarlı hale getirir
regex = re.compile(pattern, flags=re.IGNORECASE)

In [162]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [163]:
m = regex.search(text)

In [164]:
m

In [165]:
text[m.start():m.end()]

'dave@google.com'

In [166]:
print(regex.match(text))

None

In [167]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [168]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [169]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [170]:
m = regex.match("wesm@bright.net")

In [171]:
m.groups()

('wesm', 'bright', 'net')

In [172]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [173]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### **Vectorized String Functions in pandas**

In [174]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
                'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [175]:
data = pd.Series(data)

In [176]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [177]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [178]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [179]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [180]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [181]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [188]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [186]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [189]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [190]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object